[
  {
    "product_ref": "110",
    "title": "Window Perf",
    "description": "Description Technical Data Window Perf: 60/40 Window perf is a 6mil calendared, semi-conformable perforated vinyl. Black-backed with clear removable adhesive. Designed for One Way vision window applications including vehicles. 60/40 pattern conforms to nearly all municipalities’ vision requirements (consult your local laws/codes) while providing higher print visibility. It can be contour cut and laminated as add-on options. 70/30 Window perf is a 6mil calendared, semi-conformable perforated vinyl. Black-backed with clear removable adhesive. Designed for One Way vision window applications including “some” vehicles. 70/30 pattern provides a One Way Vision effect while providing the highest print visibility. It can be contour cut and laminated as add-on options. GelUV Printed using brand new technology, Custom built profiles for excellent color and laminate adhesion.   Points to know about our Perforated 60/40 Film: ● 6 Mil Calendared vinyl black-backed with clear removable ● Great for a vehicle, fleet, and store-front applications ● Removable with low heat ● 1-year minimum expected outdoor performance when unlaminated ● The polyethylene-coated paper double liner prevents ink from clogging holes ● Caution: Always pre-test vinyl installation on vehicles. Do not install if there is any adverse or negative impact on sensors and/or other safety-related equipment on the intended vehicle Points to know about our Perforated 70/30 Film: ● 6 Mil Calendared vinyl black-backed with clear removable ● Great for store-front and some vehicle applications ● Removable with heat ● 1-year minimum expected outdoor performance when unlaminated ● The polyethylene-coated paper double liner prevents ink from clogging holes ● Caution: Always pre-test vinyl installation on vehicles. Do not install if there is any adverse or negative impact on sensors and/or other safety-related equipment on the intended vehicle Points to know about our Laminate: ● 1.3 Mil, cast PVC, ultra-conformable overlaminate providing excellent abrasion resistance, and durability ● High Gloss Finish, Optically Clear ● Excellent UV, temperature, humidity, and salt-spray resistance ● Enhances color and depth ● 4-year outdoor durability",
    "url": "https://visualgraphx.com/roll/roll-stock/window-perf/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Window-Perf_Lamination_1.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "125",
    "title": "H-Stakes 10\" x 30\"",
    "url": "https://visualgraphx.com/hardware-frames/hardware/hstakes-10x30/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/10x30_H-Wire_Step_Stake_.jpg",
    "price": 2.28,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "131",
    "title": "Decals - General Performance",
    "description": "Description Technical Data General Performance Decals – Affordable, Reliable, and Professional-Grade When you need high-quality decals delivered quickly and at an affordable price, Visual Graphx’s General Performance Decals are the perfect solution. Designed for fast production and versatile use, these decals are ideal for businesses looking to make a bold statement, whether indoors or outdoors. Crafted using industry-trusted materials, our General Performance Decals ensure a professional finish that reflects your brand’s quality. With our efficient production process, you’ll get your decals promptly – without compromising on durability or visual impact. Whether you’re branding a storefront, promoting an event, or creating custom signage, Visual Graphx’s General Performance Decals combine affordability, reliability, and professional-grade results – giving you the confidence to make your mark. Technical Data for General Performance Decals: ● Default Material: Arlon DPF 510MT (or equivalent, based on availability) ● Material Type: Calendered vinyl ● Finish Options: Matte or gloss finish ● Adhesive Type: Pressure-sensitive adhesive for easy application ● Sizes: Fully customizable to fit your needs ● Durability: Suitable for both indoor and outdoor use ● Lifespan: Up to 3 years outdoors with proper application ● Printing Resolution: High-resolution digital printing at 1200 x 1200 dpi ● Application Options: Can be contour cut or kiss cut for custom shapes ● Optional Lamination: Available for added durability or aesthetic effects",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-standard/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-General-Performance_1_05253116202507.jpg",
    "price": 12.08,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "132",
    "title": "Decals - Clear",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-clear/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Clear_1_05100516202507.jpg",
    "price": 21.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "139",
    "title": "Coroplast (Vinyl Mounted)",
    "description": "Description Technical Data Coroplast (Corrugated/Fluted Plastic) What this means for you is a professional quality sign that is durable, economical, and easy to display or mount. Coroplast signs are one of the most popular and versatile sign materials available. The lightweight properties of coroplast panels have made it a popular alternative to more rigid sign materials. Corrugated plastic signs are also commonly preferred over poster board and foam core mounting board. Foam core is not waterproof, and the surface is much more sensitive to damage than corrugated plastic. With a Coroplast sign, you can advertise in almost any location. Coroplast signs, being lightweight, are easy to mount on virtually any surface. We also have a wide selection of frames and stakes that are perfect for Coroplast signs. With these mounting options, you will have no trouble getting your business or promotional message displayed professionally. Coroplast is a sturdy, waterproof, corrugated plastic sign material that resembles the appearance of “plastic cardboard.” The hollow-fluted design of Coroplast makes this sign material extremely lightweight, easy to handle, and simple to display in several ways.     Points to know about custom Coroplast Signs: ● Is essentially a plastic cardboard ● Long-term use indoors ● Ideal for low-cost, short-term outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● Available standard in 3/16” (4mm) ● Available to be printed both Single and Double-Sided ● The fluted design allows for low-cost “Yard” stake mounting ● Exceptionally Lightweight allows for many displaying options ● Serves as a durable alternative to Cardboard, Posterboard, and FoamCore signs ● Can be easily cut, creased, and folded for various display applications",
    "url": "https://visualgraphx.com/rigid/vinyl-mounted-sheets/coroplast-mounted/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Coroplast_White.jpg",
    "price": 34.49,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "140",
    "title": "ACP / ACM (Vinyl Mounted)",
    "description": "Description Technical Data ONE OF THE MOST DURABLE SIGN PANELS AVAILABLE! ACP (Aluminum Composite Panel, DiBond, Aluminum Composite Material, ACM, E-Panel) ACP is excellent for outdoor use but a great option for indoors, too.  ACP is commonly used for decorative, real estate, property, directional, road, safety, regulation, and restroom signs. ACP sign material is a composite made of both aluminum and plastic sign material. Two factory-applied electroplated white enamel-painted sheets of aluminum are permanently bonded to both sides of a high-density plastic core, sandwiching the plastic sign panel in between. The solid plastic core adds thickness and rigidity to the sheet while allowing it to remain lightweight and incredibly durable. In fact, ACP custom signs have nearly ten times the strength of a sheet of .040” aluminum, making it one of the strongest sign panels available, yet the material weighs only 32 pounds for an entire 4’ x 8’ sheet. ACP signs are an excellent choice for indoor signage. They are fairly lightweight and can be printed double-sided, so ACP is good for hanging applications as well as being easy to mount on an interior wall. When protected from exposure to harsh elements, as in an indoor application, ACP signs can last decades. ACP signs are ideal for outdoor signage. ACP is naturally a strong, weatherproof material that will hold up well against the elements. Because of Aluminum’s natural rust and weather resistance, ACP signs will stand up to the elements. ACP also has a high tolerance for cold and hot weather temperature extremes and heavy precipitation. Additionally, the solid plastic core gives an ACP sign added rigidity and durability, so it won’t easily bend or warp. Our standard ACP is one of the most durable on the market, boasting a thicker aluminum face than standard panels, and has a factory-applied electroplated enamel paint vs oven-baked, which means these panels will serve you for years. Whether hanging, post/pole-mounted, placed in a sidewalk stand, or mounted to a wall, ACP signs are a stylish and durable signage choice.         ●       Extremely durable with a Semi-Gloss Finish ●       Ideal for both Long-term use indoors ●       Optimal for Exterior Signage ●       Water and Weatherproof and Highly tolerant of temperature extremes ●       Available in 1/8” (3mm) and 1/4” (6mm) ●       Available to be printed both Single and Double-Sided ●       Lightweight, allowing for many displaying options ●       Is a durable alternative to Coroplast, BubbleBoard, PolyPanel, and Aluminum              ●       Can be easily cut or folded for various display applications",
    "url": "https://visualgraphx.com/rigid/vinyl-mounted-sheets/acp-mounted/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/ACP_White.jpg",
    "price": 64.40,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "141",
    "title": "BubbleBoard (Vinyl Mounted)",
    "description": "Description Technical Data BubbleBoard BubbleBoard is a Superior Alternative to Coroplast (Fluted Plastic) signs. BubbleBoard boasts in comparison to Coroplast a 25x Stronger substrate, higher opacity, smoother surface with a matte finish. This innovative substrate makes this one of the most versatile, durable, and economical sign materials available. What this means for you is a professional quality sign that is durable, economical and easy to display or mount. The lightweight properties of BubbleBoard have made it a popular alternative to many sign materials. Being an indoor and outdoor material, BubbleBoard is a superior product to foam core offering a similarly smooth surface but offers a higher durability and weather resistance. Similar to Coroplast, BubbleBoard is a tough, waterproof, plastic sign material engineered with a sphere (“Bubble”) core adding extreme stiffness and strength. The hollow design makes this substrate extremely lightweight, easy to handle and simple to display in a number of ways. With a BubbleBoard sign, you can advertise in almost any location with incredible durability. BubbleBoard signs are easy to mount on almost any surface, you will have no trouble getting your business or promotional message displayed in a durable and professional manner.   Points to know about custom Coroplast Signs: ● Extremely durable with a Matte Finish ● Long-term use indoors ● Ideal for low-cost short-term outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● The standard 1/8” thickness (3mm) is up to 25x stronger than Coroplast ● Available to be printed both Single and Double-Sided ● Extremely Lightweight allows for many displaying options ● Serves as a superior durable alternative to Coroplast, Cardboard, Posterboard, and FoamCore ● Can be easily cut, creased, and folded for various display applications",
    "url": "https://visualgraphx.com/rigid/vinyl-mounted-sheets/bubbleboard-mounted/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/BubbleBoard_White.jpg",
    "price": 71.93,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "142",
    "title": "PolyPanel (Vinyl Mounted)",
    "description": "Description Technical Data PolyPanel We are proud to be one of the only companies offering the revolutionary PolyPanel. PolyPanel is the perfect substrate for printed signage and point-of-sale advertising materials both indoors and out. Although these specialized sheets are just 1/8” (3mm) thick, they punch way above their weight class much like us. They are super-light and robust, highly scratch-proof, resistant to heat and chemicals, and 100% opaque. More importantly as an alternative to PVC, PolyPanel offers outdoor durability, higher flexibility before cracking, no warping in direct sunlight, and it is100% recyclable! PolyPanel sheets are designed to meet the specific needs of high impact marketing materials such as printed exhibition boards, signs, POS and POP displays. Because of their high resistance to UV light, PolyPanel sheets are ideally suited to outdoor advertising displays and are far superior to PVC sheets. When you print your marketing and advertising messages on PolyPanel, you can be sure that they will last.   Points to know about PolyPanel: ● Highly durable with a Semi-Textured Matte Finish ● Long-term use indoors ● Great for outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● The standard 1/8” thickness (3mm) is up to 25x stronger than Expanded PVC ● Available to be printed both Single and Double-Sided ● Very Lightweight allowing for many displaying options including hanging and wall mounting ● Serves as a superior durable alternative to Expanded PVC ● Can be easily cut to shape for various display applications",
    "url": "https://visualgraphx.com/rigid/vinyl-mounted-sheets/polypanel-mounted/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/PolyPanel_White.jpg",
    "price": 73.06,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "146",
    "title": "Decals - High Tack",
    "description": "Description Technical Data Vinyl – High Tack - Non-Air Release This product is intended for vehicle wraps, surface wraps, or long-term interior and exterior graphics. The films in this category should be considered Medium to Long term and designed for complex surface coverage.  GF 201 is a 3.4 mil polymeric matte white calendered vinyl coated with a clear permanent acrylic pressure-sensitive adhesive laminated to a 90# layflat liner. This vinyl is designed to accept a variety of solvent-based, eco-solvent, latex and UV curable inks common to wide format digital printing systems. The clear adhesive creates a permanent bond to a variety of common substrates used in graphics applications. The 90# liner provides excellent layflat qualities in a variety of ambient conditions along with ease of application of large format graphics.   Vinyl - High Tack - Air Release This product is intended for vehicle wraps, surface wraps, or long-term interior and exterior graphics. The films in this category should be considered Medium to Long term and designed for complex surface coverage.  GF 201 is a 3.4 mil polymeric matte white calendered vinyl coated with a clear permanent acrylic pressure-sensitive adhesive laminated to a 90# layflat liner. This vinyl is designed to accept a variety of solvent-based, eco-solvent, latex and UV curable inks common to wide format digital printing systems. The clear adhesive creates a permanent bond to a variety of common substrates used in graphics applications. The 90# liner provides excellent layflat qualities in a variety of ambient conditions along with ease of application of large format graphics.   Points to know about our GF 201HTAP - Non-Air Release    3.4 Mil Premium white calendered PVC film with HTAP permanent acrylic pressure sensitive adhesive Designed for interior or exterior signage, decals, nameplates, and POP displays 5 year durablity 90# LayFlat Liner Print compatibility: Solvent, Eco-Solvent, UV and Latex Points to know about our GF 201HTAPAE - Air Release    All the same benefits as 201 HTAP, but with Air-Egress 3.4 Mil Premium white calendered PVC film with HTAP permanent acrylic pressure sensitive adhesive Designed for interior or exterior signage, decals, nameplates, and POP displays 5 year durablity 90# LayFlat Liner Print compatibility: Solvent, Eco-Solvent, UV and Latex",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-high-tack/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-High-Tack_1_05303716202507.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "148",
    "title": "Scrim Banner",
    "description": "Description Technical Data   Display your message economically everywhere you need it to be with our vivid, eye-catching banners. Banners are great indoors and out, hanging, framed, or standing; your message will make the maximum impact. Our banners are incredibly durable, highly flexible, and designed to be portable. These banners will not stop broadcasting your message and working for you. Choose from standard sizes, or we'll create a custom size just for you.",
    "url": "https://visualgraphx.com/roll/roll-stock/scrim_banner/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Scrim-Banner_1_06533316202507.jpg",
    "price": 12.81,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "151",
    "title": "Mesh Banners",
    "description": "Description Technical Data   8oz mesh banners are a type of outdoor signage that are made of a lightweight and breathable material. They have tiny holes that allow the wind to pass through, reducing the risk of tearing or flying away. 8oz mesh banners are ideal for windy locations, such as fences, scaffolds, or building facades. They can display vivid colors and high-resolution images, making them suitable for advertising, branding, or promoting events. 8oz mesh banners are durable, weather-resistant, and easy to install and remove.",
    "url": "https://visualgraphx.com/roll/roll-stock/mesh-banners/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/8oz-Mesh-Banner_1_04135616202507.jpg",
    "price": 12.81,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "201",
    "title": "Coroplast",
    "description": "Description Technical Data FAQ Coroplast (Corrugated/Fluted Plastic) Professional-grade material for sheet-stock use. Ideal for construction & industrial; healthcare & public services; retail & point-of-sale. Customized and printed by Visual Graphx using trusted materials like Interplast Coroplast. What this means for you is a professional quality sign that is durable, economical, and easy to display or mount. Coroplast signs are one of the most popular and versatile sign materials available. The lightweight properties of coroplast panels have made it a popular alternative to more rigid sign materials. Corrugated plastic signs are also commonly preferred over poster board and foam core mounting board. Foam core is not waterproof, and the surface is much more sensitive to damage than corrugated plastic. With a Coroplast sign, you can advertise in almost any location. Coroplast signs, being lightweight, are easy to mount on virtually any surface. We also have a wide selection of frames and stakes that are perfect for Coroplast signs. With these mounting options, you will have no trouble getting your business or promotional message displayed professionally. Coroplast is a sturdy, waterproof, corrugated plastic sign material that resembles the appearance of “plastic cardboard.” The hollow-fluted design of Coroplast makes this sign material extremely lightweight, easy to handle, and simple to display in several ways. General Specifications: • Material: Coroplast or Alternative Brand (Based on Availability) • Finish: Semi-Gloss • Suitable for: Indoor and Outdoor Use • Long-term use indoors • Ideal for low-cost, short-term outdoor use • Is essentially a plastic cardboard that is Waterproof, Weather-resistant, and resistant to Temperature Extremes • Available standard in 3/16” (4mm), Other Sizes available. • Printable both Single and Double-Sided • The fluted design allows for low-cost “Yard” stake mounting and other Fabrication types • Exceptionally Lightweight allows for many displaying options • Serves as a durable alternative to Cardboard, Posterboard, and FoamCore signs • Can be easily cut, creased, and folded for various display applications • Custom Sizing and Cutting Available • Application: Architectural Signage; Point-of-Purchase Displays; Construction and Safety Signage What is Coroplast used for? Popular for yard signs, political signs, and real estate signs due to its light weight and durability. How is Coroplast installed? Most signs are displayed using H-stakes or zip ties for fences and posts.",
    "url": "https://visualgraphx.com/rigid/rigid-stock/coroplast-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Coroplast_1_04385216202507.jpg",
    "price": 24.94,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "202",
    "title": "ACP / ACM",
    "description": "Description Technical Data ONE OF THE MOST DURABLE SIGN PANELS AVAILABLE! ACP (Aluminum Composite Panel, DiBond, Aluminum Composite Material, ACM, E-Panel) ACP is excellent for outdoor use but a great option for indoors, too.  ACP is commonly used for decorative, real estate, property, directional, road, safety, regulation, and restroom signs. ACP sign material is a composite made of both aluminum and plastic sign material. Two factory-applied electroplated white enamel-painted sheets of aluminum are permanently bonded to both sides of a high-density plastic core, sandwiching the plastic sign panel in between. The solid plastic core adds thickness and rigidity to the sheet while allowing it to remain lightweight and incredibly durable. In fact, ACP custom signs have nearly ten times the strength of a sheet of .040” aluminum, making it one of the strongest sign panels available, yet the material weighs only 32 pounds for an entire 4’ x 8’ sheet. ACP signs are an excellent choice for indoor signage. They are fairly lightweight and can be printed double-sided, so ACP is good for hanging applications as well as being easy to mount on an interior wall. When protected from exposure to harsh elements, as in an indoor application, ACP signs can last decades. ACP signs are ideal for outdoor signage. ACP is naturally a strong, weatherproof material that will hold up well against the elements. Because of Aluminum’s natural rust and weather resistance, ACP signs will stand up to the elements. ACP also has a high tolerance for cold and hot weather temperature extremes and heavy precipitation. Additionally, the solid plastic core gives an ACP sign added rigidity and durability, so it won’t easily bend or warp. Our standard ACP is one of the most durable on the market, boasting a thicker aluminum face than standard panels, and has a factory-applied electroplated enamel paint vs oven-baked, which means these panels will serve you for years. Whether hanging, post/pole-mounted, placed in a sidewalk stand, or mounted to a wall, ACP signs are a stylish and durable signage choice.         ●       Extremely durable with a Semi-Gloss Finish ●       Ideal for both Long-term use indoors ●       Optimal for Exterior Signage ●       Water and Weatherproof and Highly tolerant of temperature extremes ●       Available in 1/8” (3mm) and 1/4” (6mm) ●       Available to be printed both Single and Double-Sided ●       Lightweight, allowing for many displaying options ●       Is a durable alternative to Coroplast, BubbleBoard, PolyPanel, and Aluminum              ●       Can be easily cut or folded for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/acp-acm-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/ACP_ACM_1_04152516202507.jpg",
    "price": 58.28,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "203",
    "title": "BubbleBoard",
    "description": "Description Technical Data BubbleBoard BubbleBoard is a Superior Alternative to Coroplast (Fluted Plastic) signs. BubbleBoard boasts in comparison to Coroplast a 25x Stronger substrate, higher opacity, smoother surface with a matte finish. This innovative substrate makes this one of the most versatile, durable, and economical sign materials available. What this means for you is a professional quality sign that is durable, economical and easy to display or mount. The lightweight properties of BubbleBoard have made it a popular alternative to many sign materials. Being an indoor and outdoor material, BubbleBoard is a superior product to foam core offering a similarly smooth surface but offers a higher durability and weather resistance. Similar to Coroplast, BubbleBoard is a tough, waterproof, plastic sign material engineered with a sphere (“Bubble”) core adding extreme stiffness and strength. The hollow design makes this substrate extremely lightweight, easy to handle and simple to display in a number of ways. With a BubbleBoard sign, you can advertise in almost any location with incredible durability. BubbleBoard signs are easy to mount on almost any surface, you will have no trouble getting your business or promotional message displayed in a durable and professional manner.   Points to know about custom Coroplast Signs: ● Extremely durable with a Matte Finish ● Long-term use indoors ● Ideal for low-cost short-term outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● The standard 1/8” thickness (3mm) is up to 25x stronger than Coroplast ● Available to be printed both Single and Double-Sided ● Extremely Lightweight allows for many displaying options ● Serves as a superior durable alternative to Coroplast, Cardboard, Posterboard, and FoamCore ● Can be easily cut, creased, and folded for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/bubbleboard-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/BubbleBoard_1_04364416202507.jpg",
    "price": 41.31,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "204",
    "title": "PolyPanel",
    "description": "Description Technical Data PolyPanel We are proud to be one of the only companies offering the revolutionary PolyPanel. PolyPanel is the perfect substrate for printed signage and point-of-sale advertising materials both indoors and out. Although these specialized sheets are just 1/8” (3mm) thick, they punch way above their weight class much like us. They are super-light and robust, highly scratch-proof, resistant to heat and chemicals, and 100% opaque. More importantly as an alternative to PVC, PolyPanel offers outdoor durability, higher flexibility before cracking, no warping in direct sunlight, and it is100% recyclable! PolyPanel sheets are designed to meet the specific needs of high impact marketing materials such as printed exhibition boards, signs, POS and POP displays. Because of their high resistance to UV light, PolyPanel sheets are ideally suited to outdoor advertising displays and are far superior to PVC sheets. When you print your marketing and advertising messages on PolyPanel, you can be sure that they will last.   Points to know about PolyPanel: ● Highly durable with a Semi-Textured Matte Finish ● Long-term use indoors ● Great for outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● The standard 1/8” thickness (3mm) is up to 25x stronger than Expanded PVC ● Available to be printed both Single and Double-Sided ● Very Lightweight allowing for many displaying options including hanging and wall mounting ● Serves as a superior durable alternative to Expanded PVC ● Can be easily cut to shape for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/polypanel-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/204_PolyPanel_White.jpg",
    "price": 39.03,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "205",
    "title": "Self-Standing A-Frame",
    "description": "Description Technical Data FAQ Self-Standing A-Frame Professional-grade material for a-frame-signs use. Ideal for real estate & property; retail & point-of-sale. Customized and printed by Visual Graphx using trusted materials like Interplast Coroplast. General Specifications: • Material: Interplast Coroplast • Finish: Gloss or Matte (based on availability) • Suitable for: Indoor and Outdoor Use • Custom Sizing and Cutting Available • Optional Lamination Available • Application: Custom Graphics; General Advertising; Promotional Materials Is this A-frame portable? Yes, it's lightweight and foldable for easy transport and storage. Can I change out the graphics? No, these are printed directly on the Corrugated Plastic sheets. They are designed as a low cost alternative to expensive Sign frames.",
    "url": "https://visualgraphx.com/rigid/rigid-stock/self-standing-a-frame-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Self-Standing-A-Frame_1_06551316202507.jpg",
    "price": 48.27,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "206",
    "title": "Magnets",
    "description": "Description Technical Data Magnetics Magnetic signs are perfect for a variety of uses both indoors and out. We only have one material available, but it is the best material on the market! Incredibly strong magnetism and lightweight perfect for vehicle applications that won’t blow away. Thin and durable, ideal for highly handled indoor applications like magnetic menu boards. These magnets can even be contour cut for custom shaped “decals” without adhesive! Choose from standard sizes or let us create a custom size for you. We can assist you in designing the perfect magnet for you! 30mil High Energy magnetic material perfect for indoor or outdoor applications. We recommend rounding corners for vehicle applications.   Points to know about our Magnetics: ● Maximum Size: 46\" X 10’ ● High resolution digitally printed at 600 x 1200, Flexible UV inks ● Single-Sided printable only ● .030” High Energy Film, Low Weight with Strong Bond ● UV resistant, Waterproof for Indoor and Outdoor Use ● Contour Cutting available ● Special Gloss Ink Effects available",
    "url": "https://visualgraphx.com/roll/roll-stock/magnets-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Magnets_1_06112016202507.jpg",
    "price": 13.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "207",
    "title": "Foamboard",
    "description": "Description Technical Data FoamCore is one of the most economical products we offer. It is best suited for short-term indoor signage and is very versatile. FoamCore is a composite of polystyrene foam. It offers a great image surface, allowing for smooth prints and great color, while offering some thickness and rigidity to allow a freestanding display. FoamCore is a great alternative to cardboard or poster board. FoamCore is a long-time industry standard. FoamCore is very versatile and it is also one of the most economical products we offer in the rigid printing industry. FoamCore is typically best suited for short term indoor signage, although it is versatile it, unfortunately, is not very durable. FoamCore is a 3/16” (4mm) thick composite of polystyrene foam with matte white or canvas-textured paper face stock. This combination offers a great image surface, allowing for smooth prints and great color while offering some thickness and rigidity to allow a freestanding display. This product is not recommended for outdoor use, but for a short term or in a pinch it can be utilized. It does not have any resistance to UV or Weather and will quickly erode when exposed to water, please take caution if that is your intended use.   Points to know about FoamCore Suitable for Short Term Indoor applications only • NOT RECOMMENDED FOR OUTDOOR USE • Panel Sizes: 4’ x 8’ • Standard Material 4mm (3/16”) • Single and Double Sided Printable • Matte or Canvas finish Paper Face • Waterproof, Weather-resistant, and resistant to Temperature Extremes • The standard 3/16” thickness (4mm) is a smooth alternative to cardboard or poster board • Easy to install and mount, extremely lightweight • Limited durability against Bending, Abrasion, UV, Weather,",
    "url": "https://visualgraphx.com/rigid/rigid-stock/foamboard-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Foamboard_1_06081816202507.jpg",
    "price": 20.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "209",
    "title": "Foamboard - Premium",
    "description": "Description Technical Data UltraBoard foam core board is a popular and versatile foam board product that can be used for a variety of applications. Easily cut with die cut, drag knife, router and more, UltraBoard can be fabricated to meet the needs of almost any job. With up to 10-year durability, UltraBoard is an ideal solution for interior permanent displays and signs and is offered in several thickness and color options.       Rigid polystyrene foam core board High impact, litho-grade polystyrene facers Lightweight, strong, & warp-resistant Adhesive ensures flatness and rigidity",
    "url": "https://visualgraphx.com/rigid/rigid-stock/foamboard-premium/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Foamboard-Premium_1_06093416202507.jpg",
    "price": 49.18,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "210",
    "title": "Acrylic",
    "description": "Description Technical Data   VERSATILE AND DURABLE BOTH INDOORS AND OUTDOORS! Acrylic is a very hard plastic that mimics glass and is offered in clear or white. It is the ideal sign substrate and has high durability both indoors and out. Acrylic is affordable yet highly durable and provides a look of quality and professionalism. It offers a surface that has a very high abrasion resistance, but boasts 10x shatter resistance. Fun Fact: Many Airplanes and cars have acrylic since it is much more durable than glass but just as transparent. Acrylic is a type of very hard plastic that mimics glass and is offered in clear or white. Like glass, Acrylic offers a surface that has very high abrasion resistance but boasts 10x the shatter resistance. Acrylics standard glossy surface will help your signs POP, or ask about our Matte / Frosted option for a rich printing, Glare-Free option. Acrylic signs are very versatile, from freestanding displays to wall mounted with standoffs or hanging with custom shapes. Shaping, Engraving, or Cutting is no problem with Acrylic and we offer CNC Router and Laser finishing services. Using a combination of Shaping, Engraving, and Cutting we can help you create a sign with depth, character, and elegance. When paired with Lighting, Acrylic really starts to shine as the ideal sign substrate! High durability both indoors and out, Acrylic is incredibly versatile. Fun Fact: Many Airplanes and Cars have acrylic instead of glass since it is so much more durable than glass and just as transparent with no green tinge. Acrylic has a downside, in large panel sizes it has lower crack resistance when flexed and over long term weather exposure Acrylic can form a crazed (form a microcrack, scratched surface) appearance. Acrylic as signs is affordable but highly durable and provides a look of quality and professionalism. We only use the best Acrylic, so quality is not an issue. The manufacturers we source our acrylic from have advanced the technologies required to produce acrylic rapidly over the last 3 decades. These advancements assure that each sheet is of the highest-quality, free from defects, consistent, and offers an optimal surface for superior ink adhesion.       • Ideal for both Interior and Exterior Signage • Highly recommended for Interior Illuminated Signage • Panel Sizes: 4’ x 8’ • Standard Material 1/8”, 3/16”, and 1/4” • Single and Double Sided Printable • Available standard with a High Gloss finish, Matte / • Standard in White or Clear • Long-term use indoors • Great for outdoor use • Waterproof, Weather-resistant, and resistant to Temperature Extremes • Versatile Display options available • A superior alternative to PVC Signs • It can be shaped, engraved, or cut to nearly any size and shape • Highly receptive to digital printing",
    "url": "https://visualgraphx.com/rigid/rigid-stock/acrylic-direct-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Acrylic_1_04165816202507.jpg",
    "price": 65.70,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "211",
    "title": "Acrylic - Clear",
    "description": "Description Technical Data ONE OF THE MOST DURABLE SIGN PANELS AVAILABLE! ACP (Aluminum Composite Panel, DiBond, Aluminum Composite Material, ACM, E-Panel) ACP is excellent for outdoor use but a great option for indoors, too.  ACP is commonly used for decorative, real estate, property, directional, road, safety, regulation, and restroom signs. ACP sign material is a composite made of both aluminum and plastic sign material. Two factory-applied electroplated white enamel-painted sheets of aluminum are permanently bonded to both sides of a high-density plastic core, sandwiching the plastic sign panel in between. The solid plastic core adds thickness and rigidity to the sheet while allowing it to remain lightweight and incredibly durable. In fact, ACP custom signs have nearly ten times the strength of a sheet of .040” aluminum, making it one of the strongest sign panels available, yet the material weighs only 32 pounds for an entire 4’ x 8’ sheet. ACP signs are an excellent choice for indoor signage. They are fairly lightweight and can be printed double-sided, so ACP is good for hanging applications as well as being easy to mount on an interior wall. When protected from exposure to harsh elements, as in an indoor application, ACP signs can last decades. ACP signs are ideal for outdoor signage. ACP is naturally a strong, weatherproof material that will hold up well against the elements. Because of Aluminum’s natural rust and weather resistance, ACP signs will stand up to the elements. ACP also has a high tolerance for cold and hot weather temperature extremes and heavy precipitation. Additionally, the solid plastic core gives an ACP sign added rigidity and durability, so it won’t easily bend or warp. Our standard ACP is one of the most durable on the market, boasting a thicker aluminum face than standard panels, and has a factory-applied electroplated enamel paint vs oven-baked, which means these panels will serve you for years. Whether hanging, post/pole-mounted, placed in a sidewalk stand, or mounted to a wall, ACP signs are a stylish and durable signage choice.         ●       Extremely durable with a Semi-Gloss Finish ●       Ideal for both Long-term use indoors ●       Optimal for Exterior Signage ●       Water and Weatherproof and Highly tolerant of temperature extremes ●       Available in 1/8” (3mm) and 1/4” (6mm) ●       Available to be printed both Single and Double-Sided ●       Lightweight, allowing for many displaying options ●       Is a durable alternative to Coroplast, BubbleBoard, PolyPanel, and Aluminum              ●       Can be easily cut or folded for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/acrylic-clear/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Acrylic-Clear_1_04185416202507.jpg",
    "price": 74.99,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "212",
    "title": "Posters",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/posters-print/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Posters_1.jpg",
    "price": 17.16,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "213",
    "title": "PolyBoard",
    "description": "Description Technical Data PolyBoard HEAT RESISTANT - PERFECT FOR OUTDOOR USE! We are proud to be one of the only companies offering the revolutionary PolyBoard. It is the perfect substrate for printed signage both indoors and out. PolyBoard is super-light and robust, resistant to heat and chemicals and 100% opaque. It will not warp in direct sunlight. A great alternative to Styrene and 100% recyclable! We are proud to be one of the only companies offering the revolutionary PolyBoard. PolyBoard is the perfect substrate for printed signage and point-of-sale advertising materials both indoors and out. Although these specialized sheets are just 1/32” (~1mm) thick, they punch way above their weight class much like us. They are super-light and robust, resistant to heat and chemicals, and 100% opaque. More importantly as an alternative to Styrene, PolyBoard offers outdoor durability, higher flexibility before cracking, no warping in direct sunlight, and it is 100% recyclable! PolyBoard sheets are designed to meet the specific needs of high impact marketing materials such as printed exhibition boards, signs, POS and POP displays. Because of their high resistance to UV light, PolyBoard sheets are ideally suited to outdoor advertising displays and are far superior to Styrene sheets. When you print your marketing and advertising messages on PolyBoard, you can be sure that they will last.   Key Facts • Suitable for Indoor or Outdoor applications • Panel Sizes: 4’ x 8’ • Standard Material 1mm • Single and Double Sided Printable • Highly durable with a smooth Matte Finish • Long-term use indoors • Great for outdoor use • Waterproof, Weather-resistant, and resistant to Temperature Extremes • The standard 1/8” thickness (3mm) is up to 25x stronger than Expanded PVC • Very Lightweight allowing for many displaying options including hanging and wall mounting • Serves as a superior durable alternative to Expanded PVC • Can be easily cut to shape for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/polyboard/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/213_204_PolyPanel_White.jpg",
    "price": 34.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "214",
    "title": "Creative Design Services (Hourly)",
    "url": "https://visualgraphx.com/services-69/design/creative-design-services-(hourly)/",
    "price": 87.50,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "215",
    "title": "Expanded PVC",
    "description": "Description Technical Data PolyPanel We are proud to be one of the only companies offering the revolutionary PolyPanel. PolyPanel is the perfect substrate for printed signage and point-of-sale advertising materials both indoors and out. Although these specialized sheets are just 1/8” (3mm) thick, they punch way above their weight class much like us. They are super-light and robust, highly scratch-proof, resistant to heat and chemicals, and 100% opaque. More importantly as an alternative to PVC, PolyPanel offers outdoor durability, higher flexibility before cracking, no warping in direct sunlight, and it is100% recyclable! PolyPanel sheets are designed to meet the specific needs of high impact marketing materials such as printed exhibition boards, signs, POS and POP displays. Because of their high resistance to UV light, PolyPanel sheets are ideally suited to outdoor advertising displays and are far superior to PVC sheets. When you print your marketing and advertising messages on PolyPanel, you can be sure that they will last.   Points to know about PolyPanel: ● Highly durable with a Semi-Textured Matte Finish ● Long-term use indoors ● Great for outdoor use ● Waterproof, Weather-resistant, and resistant to Temperature Extremes ● The standard 1/8” thickness (3mm) is up to 25x stronger than Expanded PVC ● Available to be printed both Single and Double-Sided ● Very Lightweight allowing for many displaying options including hanging and wall mounting ● Serves as a superior durable alternative to Expanded PVC ● Can be easily cut to shape for various display applications",
    "url": "https://visualgraphx.com/rigid/rigid-stock/epvc/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Expanded-PVC_1_06025816202507.jpg",
    "price": 72.21,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "218",
    "title": "Signicade Deluxe",
    "url": "https://visualgraphx.com/hardware-frames/hardware/signicade-deluxe/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/signicade_Black.jpg",
    "price": 321.93,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "221",
    "title": "Coroplast (Oversized)",
    "description": "Description Technical Data FAQ Coroplast (Corrugated/Fluted Plastic) Professional-grade material for sheet-stock use. Ideal for construction & industrial; healthcare & public services; retail & point-of-sale. Customized and printed by Visual Graphx using trusted materials like Interplast Coroplast. What this means for you is a professional quality sign that is durable, economical, and easy to display or mount. Coroplast signs are one of the most popular and versatile sign materials available. The lightweight properties of coroplast panels have made it a popular alternative to more rigid sign materials. Corrugated plastic signs are also commonly preferred over poster board and foam core mounting board. Foam core is not waterproof, and the surface is much more sensitive to damage than corrugated plastic. With a Coroplast sign, you can advertise in almost any location. Coroplast signs, being lightweight, are easy to mount on virtually any surface. We also have a wide selection of frames and stakes that are perfect for Coroplast signs. With these mounting options, you will have no trouble getting your business or promotional message displayed professionally. Coroplast is a sturdy, waterproof, corrugated plastic sign material that resembles the appearance of “plastic cardboard.” The hollow-fluted design of Coroplast makes this sign material extremely lightweight, easy to handle, and simple to display in several ways. General Specifications: • Material: Coroplast or Alternative Brand (Based on Availability) • Finish: Semi-Gloss • Suitable for: Indoor and Outdoor Use • Long-term use indoors • Ideal for low-cost, short-term outdoor use • Is essentially a plastic cardboard that is Waterproof, Weather-resistant, and resistant to Temperature Extremes • Available standard in 3/16” (4mm), Other Sizes available. • Printable both Single and Double-Sided • The fluted design allows for low-cost “Yard” stake mounting and other Fabrication types • Exceptionally Lightweight allows for many displaying options • Serves as a durable alternative to Cardboard, Posterboard, and FoamCore signs • Can be easily cut, creased, and folded for various display applications • Custom Sizing and Cutting Available • Application: Architectural Signage; Point-of-Purchase Displays; Construction and Safety Signage What is Coroplast used for? Popular for yard signs, political signs, and real estate signs due to its light weight and durability. How is Coroplast installed? Most signs are displayed using H-stakes or zip ties for fences and posts.",
    "url": "https://visualgraphx.com/rigid/rigid-stock/coroplast-oversized/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Coroplast-Oversized_1.jpg",
    "price": 24.86,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "226",
    "title": "Decals - Cut Vinyl",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-cutvinyl/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Cut-Vinyl_1_05131816202507.jpg",
    "price": 12.78,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "227",
    "title": "Yard Signs (Coroplast)",
    "description": "Description Technical Data FAQ Yard Signs (Coroplast) Professional-grade material for temporary signage. Ideal for construction & industrial; real estate & property; political campaigns; school spirit; and more. Customized and printed by Visual Graphx using trusted materials like Interplast Coroplast. General Specifications: • Material: Interplast Coroplast • Finish: Gloss or Matte (based on availability) • Suitable for: Indoor and Outdoor Use • Custom Sizing and Cutting Available • Optional Lamination Available • Application: Custom Graphics; General Advertising; Promotional Materials Are yard signs waterproof? Yes, Coroplast yard signs are waterproof and suitable for outdoor campaigns, real estate, and events. Can I order double-sided yard signs? Yes, we offer single and double-sided printing options for maximum visibility.",
    "url": "https://visualgraphx.com/rigid/rigid-stock/coroplast-yard-signs/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Group_1000006313.jpg",
    "price": 27.22,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "228",
    "title": "Avery V4000",
    "description": "Description Technical Data Avery 1105 + DOL 1060Z Wrap Vinyl We offer Avery’s solutions for wraps because it has consistently outperformed its competition in all areas including printability, ease of install, durability, and manufacturer support. These vehicle branding products are printed using the latest technologies, and we employ color management protocols to ensure accurate color output. Avery Super Cast Series Vinyl with Easy Apply™ RS Adhesive is a premium gloss vinyl with Grey Adhesive designed for use in vehicle wraps as well as various other branding and identity applications. Avery MPI 1105 provides superior conformability to irregular surfaces while Easy Apply™ RS features offer the benefits of reduced wrinkling and trapped air during the install process. The RS feature allows for superior slide ability and tack control while installing. Avery Dennison DOL 1000 Series Clear Cast Vinyl is a premium quality, 2mil thin cast vinyl film designed for use as a protective overlaminate film for digitally printed MPI 1105 Films. DOL 1000 Series offers exceptional performance and value for applications requiring excellent conformability, abrasion resistance, and UV durability. The gloss film provides a super smooth, high gloss paint like finish for your printed graphics. GelUV Printed using brand new technology, Custom built profiles for excellent color and laminate adhesion. MPI1105 ● 2 Mil cast gloss opaque vinyl with grey removable adhesive featuring Easy Apply (EZ air egress technology that helps reduce bubbles, wrinkles, and air entrapment during installation) and RS (repositionable and slide-able adhesive technology) ● 7-year outdoor durability, limited by exposure ● Superior conformability to irregular substrates ● 90# StaFlat Liner ● Caution: Always pre-test vinyl installation on vehicles. Do not install if there is any adverse or negative impact on sensors and/or other safety-related equipment on the intended vehicle DOL 1060Z ● 2 mil cast PVC overlaminate with superior conformability to irregular substrates ● Protects images from scratches ● Enhances color and depth of the image ● Excellent UV, temperature, humidity, and salt-spray resistance ● DOL 1060Z is on a clear synthetic liner for crystal clear paint-like finish ● UL#16gh listed for floors ● 5-year outdoor durability",
    "url": "https://visualgraphx.com/roll/roll-stock/avery-v4000/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Avery-V4000-Lamination_1_04315016202507.jpg",
    "price": 36.40,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "242",
    "title": "Decals - Cut Vinyl, Reflective",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-cut-vinyl-reflective/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Cut-Vinyl-Reflective_1_05153716202507.jpg",
    "price": 18.03,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "243",
    "title": "Posters - Backlit",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/posters-backlit/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Posters-Backlit_1_06480116202507.jpg",
    "price": 30.29,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "244",
    "title": "Acrylic - Matte, Clear",
    "description": "Description Technical Data   VERSATILE AND DURABLE BOTH INDOORS AND OUTDOORS! Acrylic is a very hard plastic that mimics glass and is offered in clear or white. It is the ideal sign substrate and has high durability both indoors and out. Acrylic is affordable yet highly durable and provides a look of quality and professionalism. It offers a surface that has a very high abrasion resistance, but boasts 10x shatter resistance. Fun Fact: Many Airplanes and cars have acrylic since it is much more durable than glass but just as transparent. Acrylic is a type of very hard plastic that mimics glass and is offered in clear or white. Like glass, Acrylic offers a surface that has very high abrasion resistance but boasts 10x the shatter resistance. Acrylics standard glossy surface will help your signs POP, or ask about our Matte / Frosted option for a rich printing, Glare-Free option. Acrylic signs are very versatile, from freestanding displays to wall mounted with standoffs or hanging with custom shapes. Shaping, Engraving, or Cutting is no problem with Acrylic and we offer CNC Router and Laser finishing services. Using a combination of Shaping, Engraving, and Cutting we can help you create a sign with depth, character, and elegance. When paired with Lighting, Acrylic really starts to shine as the ideal sign substrate! High durability both indoors and out, Acrylic is incredibly versatile. Fun Fact: Many Airplanes and Cars have acrylic instead of glass since it is so much more durable than glass and just as transparent with no green tinge. Acrylic has a downside, in large panel sizes it has lower crack resistance when flexed and over long term weather exposure Acrylic can form a crazed (form a microcrack, scratched surface) appearance. Acrylic as signs is affordable but highly durable and provides a look of quality and professionalism. We only use the best Acrylic, so quality is not an issue. The manufacturers we source our acrylic from have advanced the technologies required to produce acrylic rapidly over the last 3 decades. These advancements assure that each sheet is of the highest-quality, free from defects, consistent, and offers an optimal surface for superior ink adhesion.       • Ideal for both Interior and Exterior Signage • Highly recommended for Interior Illuminated Signage • Panel Sizes: 4’ x 8’ • Standard Material 1/8”, 3/16”, and 1/4” • Single and Double Sided Printable • Available standard with a High Gloss finish, Matte / • Standard in White or Clear • Long-term use indoors • Great for outdoor use • Waterproof, Weather-resistant, and resistant to Temperature Extremes • Versatile Display options available • A superior alternative to PVC Signs • It can be shaped, engraved, or cut to nearly any size and shape • Highly receptive to digital printing",
    "url": "https://visualgraphx.com/rigid/rigid-stock/acrylic-matte-clear/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Acrylic-Matte-Clear_1_04231716202507.jpg",
    "price": 80.70,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "253",
    "title": "Decals - Floor",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-floor/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Floor_1_05204516202507.jpg",
    "price": 13.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "255",
    "title": "3M 40c",
    "description": "Description Technical Data FAQ 3M IJ35c + Lamination Professional-grade material for General Signage & Graphics use. Ideal for retail & point-of-sale. Customized and printed by Visual Graphx using trusted materials like Custom Vinyl. General Specifications: • Material: Custom Vinyl • Finish: Gloss or Matte (based on availability) • Suitable for: Indoor and Outdoor Use • Custom Sizing and Cutting Available • Optional Lamination Available • Application: Custom Graphics; Promotional Products; Retail Signage What is 3M IJ35c used for? This intermediate vinyl is ideal for short to medium-term graphics on flat surfaces such as signs, windows, and simple vehicle decals. How long does 3M IJ35c last outdoors? With proper lamination and application, it can last up to 5 years outdoors while maintaining color vibrancy and adhesion. Why choose 3M IJ35c over premium options? It offers a balance between performance and affordability, making it a great choice for promotions, short-term branding, or budget-conscious projects. Does this vinyl offer easy installation? Yes, 3M's Comply™ adhesive provides bubble-free installation, ideal for quick, clean applications on smooth surfaces. How does Visual Graphx ensure quality when using this material? We calibrate our printers for every run and use high-resolution (1200 x 1200 dpi) printing to ensure sharp, consistent results, even on budget-friendly vinyls. Can I get this in gloss or matte finish? Yes, we offer both gloss and matte lamination options to suit your design and environmental needs. Is this suitable for vehicle wraps? It is not suitable for Vehicle applications. For vehicle graphics, we recommend our High Performance Decal product and for Wraps we recommend our various Cast wrap products.",
    "url": "https://visualgraphx.com/roll/roll-stock/3m-40c/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/255_Decal_All.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "256",
    "title": "3M - Wrap Films",
    "description": "Description Technical Data FAQ 3M IJ180mC + Lamination Professional-grade material for wraps use. Ideal for corporate & office branding; transportation & fleet. Customized and printed by Visual Graphx using trusted materials like 3M IJ180mC-10. General Specifications: • Material: 3M IJ180mC-10 • Finish: Gloss or Matte (based on availability) • Suitable for: Indoor and Outdoor Use • Custom Sizing and Cutting Available • Optional Lamination Available • Application: Fleet Graphics; Vehicle Branding; Commercial Advertising What makes 3M IJ180mC a premium choice for vehicle and surface wraps? This film offers superior conformability, slideability, and repositionability, making it ideal for complex curves and deep recesses while maintaining excellent print clarity. Why does Visual Graphx pair this film with lamination? Lamination extends the life of your graphics, enhances UV protection, and improves surface durability against scratches and cleaning agents. How long does this product typically last outdoors? With proper application and lamination, it can last up to 7 years outdoors, maintaining vibrant colors and adhesion throughout its lifespan. What types of surfaces can this vinyl adhere to? It adheres to smooth, contoured, and riveted surfaces, making it perfect for full or partial vehicle wraps, trailers, windows, and architectural panels. What kind of print quality can I expect? Visual Graphx prints on this film at up to 1200 x 1200 dpi, delivering photo-realistic clarity and vivid color saturation for all designs. Is this vinyl easy to install or reposition? Yes, the Controltac™ and Comply™ adhesive technology allows easy sliding, repositioning, and bubble-free application, even for DIY installers. Does this product meet professional standards? Absolutely. It's an industry gold standard for fleet graphics and high-impact branding, trusted by professional installers worldwide.",
    "url": "https://visualgraphx.com/roll/roll-stock/3m-wrap/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/3M-IJ180mC-Lamination.jpg",
    "price": 32.03,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "259",
    "title": "Decals - Low Tack, Glass",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-low-tack,-windows/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Low-Tack-Windows_1_05322216202507.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "260",
    "title": "Decals - Walls",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-walls-(gf-285)/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Walls-_GF-285_1_05372716202507.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "261",
    "title": "Banner Stand Film",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/banner-stand-film/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Banner-Stand-Film_1_04335916202507.jpg",
    "price": 11.99,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "262",
    "title": "Decals - High Performance",
    "description": "Description Technical Data High Performance Decals – Premium Quality, Longer Lifespan, and Exceptional Conformability For projects that demand a higher-grade decal, Visual Graphx’s High Performance Decals deliver premium quality with added features for ease of installation and durability. These decals are designed for applications that require air release technology for bubble-free installation, improved conformability for slightly curved surfaces, and a longer lifespan for maximum value. Crafted using premium materials like General Formulations AutoMark 230 , our High Performance Decals are perfect for businesses and projects that need a flawless finish and lasting results. Whether you need impactful storefront displays, vehicle signage, or high-end branding, these decals are engineered to perform in challenging conditions with ease. With Visual Graphx’s High Performance Decals , you’ll enjoy the perfect combination of innovation, quality, and reliability to take your branding to the next level. Technical Data for High Performance Decals: ● Material: General Formulations AutoMark 230 ● Material Type: 2.4 mil calendered vinyl ● Finish Options: Gloss finish ● Adhesive Type: Pressure-sensitive adhesive with air release for easy installation ● Sizes: Fully customizable to fit your needs ● Durability: Suitable for indoor and outdoor use, including slightly curved surfaces ● Lifespan: Up to 5 years outdoors with proper application ● Printing Resolution: High-resolution digital printing at 1200 x 1200 dpi ● Application Options: Can be contour cut or kiss cut for custom shapes ● Optional Lamination: Available for added durability or aesthetic effects",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-high-performance/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-High-Performance_1_05274616202507.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "265",
    "title": "Decals - MultiGRIP Floor",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-multigrip-floor/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/265_253_Decal_All.jpg",
    "price": 13.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "272",
    "title": "3M IJ35c",
    "description": "Description Technical Data FAQ 3M IJ35c + Lamination Professional-grade material for General Signage & Graphics use. Ideal for retail & point-of-sale. Customized and printed by Visual Graphx using trusted materials like Custom Vinyl. General Specifications: • Material: Custom Vinyl • Finish: Gloss or Matte (based on availability) • Suitable for: Indoor and Outdoor Use • Custom Sizing and Cutting Available • Optional Lamination Available • Application: Custom Graphics; Promotional Products; Retail Signage Q: Can I customize this product to my brand? A: Yes, all prints are fully customizable with your artwork, branding, or layout. Q: What is the turnaround time? A: Standard production is 3–5 business days, with rush options available. Q: Do you offer nationwide installation? A: Yes, we coordinate install services across the U.S. via our trusted partner network.",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-walls-(ij35c)/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/3M-IJ35c-Lamination_1_04084516202507.jpg",
    "price": 13.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "274",
    "title": "Decals - Easy Dot",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-easy-dot/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Easy-Dot_1_05181216202507.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "278",
    "title": "Decals - Floor (Heavy Duty)",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-floor-hd/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Floor-_Heavy-Duty_1_05232616202507.jpg",
    "price": 13.65,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "279",
    "title": "Decals - Optically Clear, Glass",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-optically-clear-glass-film/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Decals-Optically-Clear-Glass-Film_1.jpg",
    "price": 11.90,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "282",
    "title": "Retractable Banner Stand",
    "url": "https://visualgraphx.com/hardware-frames/hardware/retractable-banner-stand/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Retractable-Banner-Stand.jpg",
    "price": 192.50,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "283",
    "title": "Retractable Banner Stand w/ Graphics - Double Sided",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/uses/marketing-materials/retractable-banner-stand-w-graphics-double-sided/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Retractable-Banner-Stand-Graphics-Double-Sided_1_06504516202507.jpg",
    "price": 13.60,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "284",
    "title": "Retractable Banner Stand w/ Graphics - Single Sided",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/uses/marketing-materials/retractable-banner-stand-w-graphics-single-sided/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/Retractable-Banner-Stand-Graphics-Single-Sided_1_06520216202507.jpg",
    "price": 13.92,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "285",
    "title": "Canvas",
    "description": "Description Technical Data   Display your message economically everywhere you need it to be with our vivid, eye-catching banners. Banners are great indoors and out, hanging, framed, or standing; your message will make the maximum impact. Our banners are incredibly durable, highly flexible, and designed to be portable. These banners will not stop broadcasting your message and working for you. Choose from standard sizes, or we'll create a custom size just for you.",
    "url": "https://visualgraphx.com/roll/roll-stock/canvas/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/285_Banner_05513613202312.jpg",
    "price": 12.89,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "289",
    "title": "FabricMate 1/4\" Track (5')",
    "description": "Our New & Improved FS005 Slim-Line™ 1/4\" Frame  (actual height 3/8 in.) has been updated with an increased height to better accommodate 1/4\" substrates and allow for the proper air gap, as well as new Glue Grooves for better adhesion when using the adhesive and staple method. Slim square 1/4 inch profile (actual height 3/8 in.) is economical and ideal for residential and office applications Easy to install with sure-grip jaws to hold fabric tight Ridged bottom for better surface adhesion Can be used as a Perimeter or Intermediate piece Deco-Frame is ideal for Perimeter or exposed areas to match with your trims Sold and shipped in 5-foot segments (length may vary +/- 1/2\") Made of durable uPVC",
    "url": "https://visualgraphx.com/hardware-frames/hardware/fabricmate-14-track-(5-)/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/image_1024.jpg",
    "price": 41.13,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "290",
    "title": "FabricMate 1/4\" Flex Track (5')",
    "description": "Our New & Improved KF005 Slim-Line™ 1/4\" Flex-Frame  (actual height 3/8 in.) has been updated with an increased height to better accommodate 1/4\" substrates and allow for the proper air gap, as well as new Glue Grooves for better adhesion when using the adhesive and staple method. Great for creating curved panel edges & seams for residential and office applications. Slim square 1/4 inch profile (actual height 3/8 in.) is economical and ideal for residential and office applications Easy to install with sure-grip jaws to hold fabric tight Ridged bottom for better surface adhesion Can be used as a Perimeter or Intermediate piece Deco-Frame is ideal for Perimeter or exposed areas to match with your trims Sold and shipped in 5-foot segments (length may vary +/- 1/2\") Made of durable uPVC",
    "url": "https://visualgraphx.com/hardware-frames/hardware/fabricmate-14-flex-track-(5-)/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/image_1024_1_.jpg",
    "price": 48.62,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "291",
    "title": "Fabric - Blockout",
    "description": "Description Technical Data   Display your message economically everywhere you need it to be with our vivid, eye-catching banners. Banners are great indoors and out, hanging, framed, or standing; your message will make the maximum impact. Our banners are incredibly durable, highly flexible, and designed to be portable. These banners will not stop broadcasting your message and working for you. Choose from standard sizes, or we'll create a custom size just for you.",
    "url": "https://visualgraphx.com/roll/roll-stock/fabric-blockout/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/291_285_Banner_05513613202312.jpg",
    "price": 11.91,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "293",
    "title": "Faux Canvas",
    "description": "Description Technical Data FoamCore is one of the most economical products we offer. It is best suited for short-term indoor signage and is very versatile. FoamCore is a composite of polystyrene foam. It offers a great image surface, allowing for smooth prints and great color, while offering some thickness and rigidity to allow a freestanding display. FoamCore is a great alternative to cardboard or poster board. FoamCore is a long-time industry standard. FoamCore is very versatile and it is also one of the most economical products we offer in the rigid printing industry. FoamCore is typically best suited for short term indoor signage, although it is versatile it, unfortunately, is not very durable. FoamCore is a 3/16” (4mm) thick composite of polystyrene foam with matte white or canvas-textured paper face stock. This combination offers a great image surface, allowing for smooth prints and great color while offering some thickness and rigidity to allow a freestanding display. This product is not recommended for outdoor use, but for a short term or in a pinch it can be utilized. It does not have any resistance to UV or Weather and will quickly erode when exposed to water, please take caution if that is your intended use.   Points to know about FoamCore Suitable for Short Term Indoor applications only • NOT RECOMMENDED FOR OUTDOOR USE • Panel Sizes: 4’ x 8’ • Standard Material 4mm (3/16”) • Single and Double Sided Printable • Matte or Canvas finish Paper Face • Waterproof, Weather-resistant, and resistant to Temperature Extremes • The standard 3/16” thickness (4mm) is a smooth alternative to cardboard or poster board • Easy to install and mount, extremely lightweight • Limited durability against Bending, Abrasion, UV, Weather,",
    "url": "https://visualgraphx.com/rigid/rigid-stock/faux-canvas/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/293_Foamboard_1_06081816202507.jpg",
    "price": 32.23,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "294",
    "title": "Curtain Track (3') - Ceiling / Wall",
    "description": "Metal heavy-duty curtain track: silent smooth anti-corrosion will not bend or deform can carry more weight can be freely cut to size Aluminum alloy material adopts high-standard aluminum with a smooth surface If the ceiling is made of drywall, professional expansion plugs and extension screws are required For wall mounting, bracket adapters are required",
    "url": "https://visualgraphx.com/hardware-frames/hardware/curtain-track-(3-)-ceiling-wall/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/41_haQmepHL_AC_US100_.jpg",
    "price": 133.00,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "296",
    "title": "Arlon V9700 - Vehicle Wrap Film",
    "description": "Description Technical Data Arlon V9700 Premium Cast Wrap Vinyl + Arlon 3370 PU Clear Laminate Arlon V9700 is a premium cast vinyl designed for full and partial vehicle wraps, fleet graphics, and complex surfaces. With FLITE Technology®, V9700 offers effortless repositioning, superior conformability, and vibrant print quality for eye-catching graphics. Its low initial tack and clean removability make installation and removal easy, even on deep channels and curves. For ultimate protection and a stunning high-gloss finish, we pair V9700 with Arlon 3370 PU Clear Laminate. This advanced polyurethane overlaminate provides up to 12 years of outdoor durability, exceptional scratch resistance, and protection against harsh chemicals. The 3370 laminate enhances color vibrancy, provides long-lasting protection, and maintains a pristine appearance over time [[1]][[2]]. Why choose Arlon V9700 + 3370? Outstanding print quality and color vibrancy FLITE Technology® for easy installation and repositioning Excellent conformability to complex surfaces and deep channels Up to 12 years of outdoor durability with 3370 laminate Scratch recovery and chemical resistance for long-lasting graphics High-gloss, paint-like finish V9700 Cast Wrap Film ● 2 mil (50 micron) premium cast vinyl with FLITE Technology® ● Gloss white finish with grey, permanent, pressure-sensitive adhesive ● Superior conformability to rivets, curves, and deep channels ● Clean removability up to 7 years (unprinted, vertical exposure) ● Outdoor durability: up to 10 years (unprinted, vertical exposure) ● Compatible with solvent, eco-solvent, UV, and latex inks ● 90# PE lay-flat liner for easy handling Arlon 3370 PU Clear Laminate ● 1.5 mil (38 micron) premium polyurethane film ● High-gloss finish for a stunning appearance ● Permanent, clear adhesive ● Outdoor durability: up to 12 years (unprinted, vertical exposure) ● Exceptional scratch recovery and chemical resistance ● Suitable for flat, simple curves, compound curves, corrugated surfaces, and rivets ● Fire tested: Class A rating under ASTM E-84 ● Cold laminating application Note: Always test vinyl installation on intended surfaces. Do not install if there is any adverse impact on vehicle sensors or safety equipment.",
    "url": "https://visualgraphx.com/roll/roll-stock/arlon-wraps/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/296_Avery-MPI-1105-Lamination_1_04250816202507.jpg",
    "price": 32.11,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "297",
    "title": "Arlon V9500 - Wall Wrap Film",
    "description": "Description Technical Data Arlon DPF V9500 Non-PVC Wall Film + Arlon 3370 PU Clear Laminate Arlon DPF V9500 is a premium, printable, non-PVC polyurethane film engineered specifically for textured wall surfaces. Its high-tack adhesive and air-egress liner ensure secure adhesion to rough, irregular, or highly textured surfaces, while allowing for easy repositioning and a seamless, paint-like finish. DPF V9500 is designed for both interior and exterior wall graphics, including building wraps, and offers outstanding conformability and durability for up to 10 years (unprinted). For maximum protection and a brilliant finish, pair DPF V9500 with Arlon 3370 PU Clear Laminate. This advanced polyurethane overlaminate provides up to 12 years of outdoor durability, exceptional scratch resistance, and protection against harsh chemicals. The 3370 laminate enhances color vibrancy, provides long-lasting protection, and maintains a pristine appearance over time. Why choose Arlon DPF V9500 + 3370? Premium non-PVC, sustainable polyurethane construction Engineered for textured and irregular wall surfaces High-tack adhesive for secure, long-lasting installation Effortless repositioning and air-egress liner for bubble-free results Up to 10 years durability (unprinted) with DPF V9500 Up to 12 years outdoor durability with 3370 laminate Exceptional scratch recovery and chemical resistance High-gloss, paint-like finish for vibrant, impactful graphics Wide temperature range for installation in hot or cold environments DPF V9500 Wall Film ● Premium, printable, non-PVC polyurethane film ● Designed for textured, rough, and irregular wall surfaces ● High-tack, repositionable adhesive with air-egress liner ● Paint-like finish with excellent conformability ● Wide installation temperature range ● Outdoor durability: up to 10 years (unprinted, vertical exposure) ● Sustainable, PVC-free construction Arlon 3370 PU Clear Laminate ● 1.5 mil (38 micron) premium polyurethane film ● High-gloss finish for a stunning appearance ● Permanent, clear adhesive ● Outdoor durability: up to 12 years (unprinted, vertical exposure) ● Exceptional scratch recovery and chemical resistance ● Suitable for flat, simple curves, compound curves, corrugated surfaces, and rivets ● Fire tested: Class A rating under ASTM E-84 ● Cold laminating application Note: Always test vinyl installation on intended surfaces. Do not install if there is any adverse impact on building sensors or safety equipment.",
    "url": "https://visualgraphx.com/roll/roll-stock/arlon-v9500/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/297_Avery-MPI-1405-Lamination_1_04295416202507.jpg",
    "price": 32.11,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  },
  {
    "product_ref": "300",
    "title": "Decals - Frosted Clear",
    "description": "Description Technical Data Vinyl – General Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our Standard Vinyl is an incredibly durable, long-lasting, scratch-resistant film. We employ the latest technologies to ensure vivid colors and maximum image precision. We have carefully curated our material selection to make sure you are offered only proven options that we can stand behind, and you can trust. This Standard Vinyl is easily applied, from floor to ceiling you can create an impactful message that sticks anywhere! We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Vinyl - High-Performance, Printed Self-adhesive decals and signs are the most prolific medium for advertising today. You can see them on car windows, vehicle surfaces, laptops, folders, floors, walls, indoors and out, and nearly anywhere people can imagine sticking them! Our High-Performance Vinyl offers all the same benefits as our Standard Vinyl like being an incredibly durable, long-lasting, scratch-resistant film. This film carries the additive benefit of being thinner and more pliable than our Standard Vinyl opening up more application uses. This benefit is paired with an extremely functional air-release adhesive system that also boasts slide ability and extended removability with heat. Also suited for partial vehicle wraps and large decals, it is also slip-resistant for use as floor graphics. As with our standard vinyl, we employ the latest technologies to ensure vivid colors and maximum image precision. We offer both standard and custom size options, straight edges, or custom contour cutting. Our products are provided with various finishing options like kiss and or through cutting, Weeding, Masking, and other options.   Points to know about our Standard Vinyl: ● Maximum Size: 52\" X 145' ● 3.5mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor or Outdoor applications ● Does not require lamination for durability or colorfast in outdoor usage ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available for added durability or effects Points to know about our High-Performance Vinyl: ● Maximum Size: 52\" X 145' ● 2.4 mil Thick, unlaminated ● High resolution digitally printed at 1200 x 1200, GelUV inks ● Inks are extremely abrasion and chemical resistant ● Available with Gloss or Matte Ink ● Single-Sided printable only ● Suitable for Indoor, Outdoor, and large coverage vehicle applications ● Can be contour kiss or through-cut for added dimension ● Grey tinted adhesive to block out color transfer from the applied surface ● Lamination available as standard to increase durability and for easier application",
    "url": "https://visualgraphx.com/roll/roll-stock/decals-frosted-clear/",
    "image_url": "https://dei4q67dwezeh.cloudfront.net/ctmediaon/images/product/300_Decals-Optically-Clear-Glass-Film_1.jpg",
    "price": 12.78,
    "metadata": {
      "condition": "new",
      "brand": "Visual Graphx, LLC.",
      "adult": "no",
      "gender": "unisex"
    }
  }
]